namespace TestTasks1_51
{
    internal class Task7_2
    {
        public void Do()
        {
            /*
             7.2	Что такое Clean Architecture? В чем её преимущества?

                Clean Architecture или как ее еще называют луковая архитектура - архитектурный подход при котором у нас есть ядро - доменный слой
            и все последующие слои накладываются друг на друга, как у лука. Т.е сначала идет доменный слой, в котором мы прописываем все
            модели данных с которыми будет работать программа, интерфейсы репозиториев, без реализации. Затем идет слой инфраструктуры - реализация 
            репозиториев, внешние сервисы, EF core. Потом идет слой бизнес логики - сервисы описывающие бизнес логику, DTO и.т.д. И потом идет
            слой представления - контроллеры, API, UI. Иногда еще есть прослойка адаптеров, они конвертируют сырые данные от слоя бизнес логики, в готовые
            данные для возврата в слой представления. При этом каждый слой не зависет от наружного слоя и зависит от внутренних.

                Такой подход позволяет обеспечить легкую тестируемость (тот же слой бизнес логики не зависит от слоя источника данных и не обязательно
            поднимать реальную бд для тестов), заменяемость (например если поменяли  API на gRPC, то переписываем только слой представления, 
            а не всю логику работы приложения). Бизнес логика собрана в одном месте и изолирована, т.е она не размазана по репозиториям и контроллерам.
            Позволяет разрабатывать приложение параллельно, frontend работает только со слоем презентации, в то время как backend работает с бизнес логикой.
            И одно из самых важных - долгосрочная поддержка. При развитии проекта структура кода остается простой для понимания и легко читаемой.

             */
        }
    }
}
