namespace TestTasks1_51
{
    internal class Task2_4to7
    {
        /*
         2.4 Что такое hints

         Ответ: Директивы, встраиваемые в SQL-запрос, чтобы подсказать оптимизатору СУБД, как именно выполнить запрос.
         */


        /*
         2.5	Какие виды блокировок существуют?

         Ответ: 1)	Когда блокируется вся таблица
                2)	Когда блокируется какая-то страница таблицы
                3)	Когда блокируется конкретная строка
                Так же можно поделить на оптимистичную и пессимистичную:
                Оптимистичная – ничего не блокирует при чтении, при записи проверяет не изменились ли данные, если изменились то ошибка с повтором, дэфолтный режим работы в постгрес,
                Пессимистичная – блокирует строку до измения, ее нельзя ни читать ни изменять. SELECT FOR UPDATE пример такой блокировки

         */



        /*
         2.6	Что такое транзакция?

        Ответ: Операция состоящая из нескольких SQL запросов. 
        Если при выполнении этих запросов хотябы 1 выдаст ошибку – то все операции откатываются. 
        Т.е соблюдается атомарность.
        
        */

        /*
         2.7	Чем delete … от truncate … отличается?

           Ответ: При использовании DELETE мы можем фильтровать какие данные хотим удалить.
           Так же удаление не произойдет пока существуют записи из других таблиц ссылающиеся на строки которые мы хотим удалить. 
           При этом само удаление происходит в несколько этапов, строка сначала помечается на удаление,
           потом происходит вызов удаления (если не ошибаюсь то через VACUUM).
           При использовании TRUNCATE удаляется вся таблица, точнее создается новый файл таблицы,
           а старый помечается на удаление и позже автоматически удаляется.
           Все новые записи помещаются в новый файл таблицы. 
           При этом мы можем почистить всю таблицу даже с учетом того что на ее строки есть ссылки 
           из других таблиц при помощи TRUNCATE CASCADE (зависимые строки так же будут удалены) или 
           же TRUNCATE RESTICT, если нам важно сохранить зависимые данные

        */
    }
}
