namespace TestTasks1_51
{
    internal class Task4_3
    {
        public void Do()
        {
            /*
             4.3	ЧТО ТАКОЕ ИНТЕРФЕЙСЫ И DEPENDENCY INJECTION. ЗАЧЕМ ИХ ПРИДУМАЛИ, КАКИЕ ВЫГОДЫ ОТ ИХ ИСПОЛЬЗОВАНИЯ

                Интерфейс это по сути контракт, который определяет что класс умеет делать. Класс реализующий интерфейс должен
            предоставить реализацию всех методов и свойств прописанных в интерфейсе. Для интерфейса нельзя создать экземпляр. 
            Но он может определять методы и свойства (но начиная вроде с 8й версии с# можно писать дефолтные методы с реализацией).
            Так же классы могут реализовывать несколько интерфейсов. Интерфейс позволяет классам не зависеть от конкретных деталей реализации друг друга.

                Dependency Injection (DI) - паттерн, при котором обьект не создает свои зависимости сам, а получает их из вне, как правило через конструктор.

                Главной выгодой от использования интерфейсов и DI является возможность подменять конкретную реализацию на другую при необходимости, 
            без изменения логики работы. Так же образуется единая точка конфигурации, где все заивисимости прописаны в одном месте, что улучшает читаемость кода, 
            и облегчает настройку прилложения. И еще одним из важных преимуществ является тестируемость, мы можем подменять зависимости на заглушки для 
            тестирования логики работы классов.
            */
        }
    }
}
