namespace TestTasks1_51
{
    internal class Task3_4
    {
        public void Do()
        {
            /*
            3.4	В ЧЕМ РАЗНИЦА МЕЖДУ CTE (COMMON TABLE EXPRESSION) И ВРЕМЕННОЙ ТАБЛИЦЕЙ?

            Овтет: 
            CTE существует только в рамках одного SQL запроса.
            Временная таблица существует в рамках одной сессии(подключения к бд) или 
            до явного удаления.
            Так же к ней можно обращаться из разных SQL запросов и в нее 
            можно добавлять индекс или удалять когда она становится ненужной
            */
        }
    }
}
