namespace TestTasks1_51
{
    internal class Task7_4
    {
        public void Do()
        {
            /*
             7.4	Что такое Docker? Зачем он нужен в разработке?

                Docker - инструмент для запуска приложений в изолированных контейнерах, позволяет быстро поднять экземпляр приложения, без 
            долгой настройки. Контейнер сам подгружает все зависимости, сам производит настройку. При этом контейнер работает одинаково везде,
            в любой среде.

                Для запуска приложения в контейнер мы должны написать Dockerfile - инструкция по сборке образа приложения (image).
            Image - шаблон контейнера. Содержит ОС, зависимости, код приложения. И сам контейнер - экземпляр образа.

            Docker позволяет обеспечить одинаковое окружение везде - при локальной разработке, на сервере - один и тот же контейнер. Так же
            обеспечивает изоляция - каждый сервис находится в своем контейнере и не зависит от других и не мешают друг другу. Обеспечивает 
            масштабируемость приложения, можно быстро запустить несколько экземляров приложения для распределения нагрузки.
            

            Опять же хочу уточнить, что сам максимум что делал это вызывал docker compose build/push/pull и up. 
             */
        }
    }
}
