namespace TestTasks1_51
{
    internal class Task4_6
    {
        public void Do()
        {
            /*
             4.6	ЧТО ТАКОЕ ENTITY FRAMEWORK CORE?

                ENTITY FRAMEWORK CORE - это ORM (object relational mapper) позволяющий работать с бд через с# классы, без написания sql вручную.
            ORM мапит классы с таблицами в базе данных, позволяя работать с обьектами, в то время как сам EF CORE генерирует sql.
            
            Ключевым обьектами в EF CORE являются DbContext, который представляет собой сессию с бд, содержит DbSet'ы и конфигурации таблиц и
            DbSet'ы представляющие собой коллекции обьектов, которые были взяты и сгенерированы из таблицы. 
                Еще одним из ключевых обьектов является класс Entity, который как раз таки и мапится на всю таблицу.

            Так же EF CORE упрощает нанесение миграций использованием простых комманд таких как Add-Migration -context "Наш контекст" "Название миграции",
            и при этом не нужно писать вручную sql по типу ALTER TABLE.

            EF CORE предоставляет несколько способов маппинга:
            1) Code first - когда мы сначала пишем код, а потом EF core генерирует из них таблицы
            2) Database first - когда сначала мы создаем базу данных, а потом EF core генерирует из ее таблиц классы

                Позволяет использовать разные провайдеры баз данных без изменения логики запросов к ним.
            Так же позволяет использовать linq запросы. И одной из важных особенностей является Change Tracking - EF core хранит снимок (snapshot) отслеживаемых сущностей 
            при загрузке, и при вызове SaveChanges() сравнивает snapshot с текущим состоянием, поэтому при операциях чтения нужно быть либо осторожнее, чтобы случайно не поменять 
            свойство у отслеживаемого обьекта, либо вызывать AsNoTracking что даже лучше, тк обеспечит лучшее быстродействие.
             */
        }
    }
}
