namespace TestTasks1_51
{
    internal class Task4_5
    {
        public void Do()
        {
            /*
             4.5	ЧТО ТАКОЕ SWAGGER? ЗАЧЕМ ОН НУЖЕН?

                Это инструмент который позволяет документировать и тестировать API.
            Он сам генерирует документацию к API на основе контроллеров, моделей и атрибутов и предоставляет UI, в котором описаны все эндпоинты 
            и их параметры, которые можно протестировать. При этом при любом изменении кода документация автоматически будет сгенерирована под него и будет всегда актуальной.

            Позволяет облегчить работу фронтендерам, тк не нужно спрашивать у бэкэндеров а какие параметры должны быть, или что должно лежать в теле запроса, это 
            все сразу описывается в документации.
             */
        }
    }
}
