namespace TestTasks1_51
{
    internal class Task4_7
    {
        public void Do()
        {
            /*
             4.7	В ЧЕМ РАЗНИЦА МЕЖДУ DAPPER И ENTITY FRAMEWORK CORE? КОГДА ЧТО ИСПОЛЬЗОВАТЬ?

            Dapper это что-то вроде микро-ORM, которое маппит результат sql запроса на с# обьект, при этом нужно самому писать sql.
            А ENTITY FRAMEWORK CORE - полноценная ORM, сам генерирует sql.

            Думаю что Dapper лучше использовать только в случаях когда много тяжелых операций чтения, потому что Dapper будет побыстрее.
            Или когда нужно написать сложный запрос, допустим с общими табличными выражениями.

                EF Core сам по себе довольно удобный, с ним легко писать CRUD операции, применять миграции, скорость самой разработки увеличивается
            и он позволяет быстро сменить провайдера.

            Зачастую использовал и то и то вместе, были случаи когда писал сложные запросы с CTE, но в основном пользовался встроенными методами EF CORE
             */
        }
    }
}
