namespace TestTasks1_51
{
    internal class Task6_1
    {
        public void Do()
        {
            /*
            6.1	Экономика:
            Есть 2 формы налогообложения:
            Налог платится в размере 6% налогов от доходов
            Налог платится в размере 15% от разницы (доходы – расходы)
            Вопрос: при каком уровне расходов (в % от доходов) эти две системы эквивалентны по выплате налогов


                Пусть доходы - A, расходы - B
            Тогда 1я форма: налог = 0.06 * A
            2я форма налог = 0.15 * (A - B)

            Приравниваем и получаем 0.06 * A = 0.15 * (A - B)
            раскрываем скобки 0.06 * A = 0.15 * A - 0.15 * B
            далее переносим все A в левую часть и получаем 
            0.06 * A - 0.15 * A = - 0.15 B => - 0.09 * A = - 0.15 * B => 
            0.09/0.15 = B/A => 3/5 = B/А => 0.6  = B/А, из этого следует что
            при уровне расходов (B) в 0.6 (60%) от доходов (А) эти две системы налогообложения будут эквивалентны. Ответ 60 %.
            */
        }
    }
}
