namespace TestTasks1_51
{
    internal class Task4_2
    {
        /*
         4.2	ЧТО ТАКОЕ ASYNC/AWAIT? ДЛЯ ЧЕГО ОНИ НУЖНЫ?
        Ответ: ASYNC/AWAIT - это ключевые слова для создания асинхронного метода.

            Модификатор ASYNC означает что метод может быть выполнен асинхронно и к нему может 
        быть применен оператор await. Async по сути указывает компилятору, что из этого метода нужно сгенерировать AsyncStateMachine.
        Оператор await в свою очередь указывает на то, что нужно дождаться завершения выполнения задачи.

            Сама по себе асинхронность это механизм оптимизации работы с потоками.До введения механизма асинхронности 
        разработчики использовали Task.Run() и внутри него вызывали синхроные I/O операции, это блокировало поток на все время ожидания.
        С введением асинхронности эта проблема ушла, ведь теперь при вызове блокирующей операции поток высвобождается и возвращается в пул,
        и может быть переиспользован для выполнения других задач, а при завершении блокирующей операции поток восстанавливается и возвращает результат.

            Когда выполнение доходит до оператора await IL компилирует метод заглушку и генерирует AsyncStateMachine.
        В методе заглушке происходит инициалзаця AsyncStateMachine, для нее в свою очередь инициализируется AsyncTaskMethodBuilder.
        Конечному автомату(AsyncStateMachine) задается начальное состояние -1. Сохраняются параметры и локальные переменные метода где произошел вызов await,
        вызывается метод Start у AsyncTaskMethodBuilder. и вызывается return AsyncTaskMethodBuilder.Task.

            Сам конечный автомат содержит следующие поля:
        1) Параметры и переменные метода где был вызван await
        2) Текущее состояние
        3) TaskAwaiter для каждого await который был в методе
        4) ExecutionContext - контекст выполнения (содержит в себе права доступа, AsyncLocal переменные по типу HttpContext)
        5) AsyncTaskMethodBuilder 

        При старте AsyncTaskMethodBuilder вызывается метод MoveNext этого конечного автомата. 
        Происходит вызов ExecutionContext.Capture() - контекст выполнения захватывается.

        Все тело метода обернуто в конструкцию try...catch(OperationCanceledException)...catch(Exception)
        Внутри блока try находится конструкция из switch( или if else, но мне больше удобнее обьяснять на switch), а так же оператора go_to. 
        Каждый Case соответствует опеределенному состоянию конечного автомата.
        Первым запускается Case для начального состояния (-1 или же default).
        Внутри него сначала выполняется весь код до вызова оператора await, затем запускается Task для которого вызывался awaiter и
        полученный awaiter сохраняется в переменную конечного автомата. После этого проверяется не выполнена ли задача синхронно, т.е
        if(!awaiter.IsCompleted) (тут важно сказать что  TaskAwaiter реализует INotifyCompletion внутри
        которого есть свойство IsCompleted передающее состояние задачи (заверщена или нет) и метод OnCompleted(Action continuation) - внутри которого регистрируется продолжение
        и метод GetResult() - возвращает результат выполнения)

        Если же операция была завершена синхронно, то через оператор go_to выполнение переходит на код после await, но сначала вызывается
        awaiter.GetResult(), затем выполняется код после первого await и как и для первого await происходит все то о чем я написал ранее.
        
        Однако если операция не была завершена синхронно к моменту проверки if(!awaiter.IsCompleted) то конечный автомат меняет свое состояние на следующее и происходит 
        taskMethodBuilder.AwaitUnsafeOnCompleted в параметрах которого передается текущий awaiter и сам конечный автомат.
        Внутри метода AwaitUnsafeOnCompleted происходит вызов OnCompleted(continuation) для текущего awaiter и внутри OnCompleted указывается что должен быть вызван 
        метод MoveNext текущего конечного автомата.Сам awaiter внутри себя проверяет, захвачен контекст синхронизации или нет(и не подавлен ли он через ConfigureAwait(false)).
        Если был, то continuation ставится на SynchronizationContext и будет выполнен в вызывающем потоке. Если нет, то continuation будет выполнен на любом свободном потоке из ThreadPool

        После AwaitUnsafeOnCompleted происходит вызов return и поток освобождается. Когда задача завершается, вызывается OnCompleted который 
        в свою очередь дергает MoveNext и выполнение переходит в следующий этап, и так до тех пор пока метод не будет выполнен.
        После выполнения происходит вызов taskMethodBuilder.SetResult() который и устанавливает для внутри хранящегося Task результат выполнения,
        а состояние конечного автомата меняется на -2. После чего конечный автомат завершает работу.

        Если же во время выполнения возникает исключение, то выполнение MoveNext переходит в блок Catch и вызывается taskMethodBuilder.SetException() 
        и состояние конечного автомата так же меняется на -2, после чего вызывается return;

        Однако, важно уточнить что для исключения отмены операции(OperationCanceledEception) происходит почти тоже самое что и для обычного Exception,
        но taskMethodBuilder вызывает не .SetException() а .SetCanceled(), что переводит внутренний Task не в состояние Faulted,а в состояние Canceled.
         */
    }
}
