namespace TestTask5_2
{
    public class Task7_3
    {
        public void Do()
        {
            /*
             7.3	Что такое CI/CD? 

                CI - Continious Integration - непрерывная интеграция. Автоматическая сборка и тестирования кода, при каждом коммите/пуше в репозиторий.
            Допустим разработчик запушил код, Github Actions / Gitlab CI автоматически собирает проект, запускает тесты и если что то упало - оповещает команду
            
            CD - Continuous Delivery - код автоматически собирается, тестируется и ждет ручного подтверждения деплоя в прод.
            /Deployemnt - все автоматически, деплой в прод тоже.

            Скажу сразу я не занимался настройкой CI/CD ни разу. Максимум я заливал фичи на тест.
             */
        }
    }
}
