namespace TestTasks1_51
{
    internal class Task5_1
    {
        public bool FindDuplicates(int[] arr)
        {
            /*
            5.1	Поиск дублей в массиве
            Дано:
            Есть массив M с типом int32, в массиве N элементов. N – очень много.
            Есть комп. с неограниченным объемом памяти. Память можно использовать любым образом.
            Вопрос:
            Циклом за один проход по массиву определить имеются ли в нем повторяющиеся элементы 
            Написать алгоритм или рассказать идею, как решить
            Решение на 5+ - реализовать без применения HashSet
            */

            //Тк память неограничена я бы создал массив флаг у которого индексы - все возможные значения int32  в uint, а значения - true или false
            //(отметка о том, видели мы этот элемент ранее или нет),
            //В uint потому что int хранит в себе значения  от -2 147 483 648 до 2 147 483 647, а индекс не может быть отрицательным.uint - это беззнаковый int.
            //Количество значений в нем такое же как и в int, но диапазон начинается от 0 до 4 294 967 295, и это число можно использовать как индекс массива.
            //Но это с условием что мы установили GCAllowVeryLargeObjects : true, потому что иначе вылетит OutOfMemoryException,
            //тк изначально максимальный размер обьекта не должен превышать 2Гб


            var exist = new bool[uint.MaxValue];

            for(var i = 0; i < arr.Length; i++)
            {
                //преобразуем значение int 32  в uint чтобы получить индекс массива флага
                uint index = (uint)arr[i];

                //если мы уже видели такой элемент, то возвращаем true. Дубликат найден.
                if (exist[index])
                {
                    return true;
                }

                //если нет, то помечаем что уже когда-то видели такой элемент
                exist[index] = true;
            }

            return false;
        }
    }
}
