namespace TestTasks1_51
{
    internal class Task7_1
    {
        public void Do()
        {
            /*
             7.1	Что такое SOLID? Приведите пример применения

            SOLID - пять принципов ООП, обеспечивающие поддерживаемость кода, делая его тестируемым и расширяемым:

                S - Single responsibility - принцип единственной ответственности. 
            Т.е допустим есть класс по работе с email, по принципу единственной ответственности он не должен отвечать еще и за 
            отправку sms на телефон. Еще можно сказать что класс должен иметь только 1 причину для изменения. Т.е если условно 
            у нас в EmailService будет генерация самих email и допустим их экспорт в pdf, то будет 2 причины для изменения данного класса.
            Потому что может измениться логика генерации самих email (1я причина для изменения кода этого класса) и может измениться формат 
            самого PDF файла (2я причина). Поэтому лучше будет разделить данный класс на 2, 1 который генерирует, второй экспортирует.

                O - open/closed - принцип открытости/закрытости.
            Класс должен быть открыт для расширения, но закрыт для модификации. Т.е если мы добавляем новое поведение, эти изменения не
            должны затрагивать существующий код. 
            Допустим у нас есть класс рассчитывающий скидку. Скидок может быть несколько видов и изначально мы прописали логику расчета через 
            switch, в этом случае, чтобы добавить новый тип скидки, придется менять существующий код, что может привести к сбою в работе.

            Чтобы соблюсти принцип, необходимо для каждого типа скидки сделать свой отдельный класс для расчета, 
            и допустим 1 интерфейс IDiscountCalculator с методом Calculate, который и будут реализовывать каждый новый класс под новый тип скидки.

                L - Liskov Substitution Principle - принцип подстановки Лисков
            Каждый наследник должен быть реализован так, чтобы его можно было подставить заместо базового класса без нарушения логики
            работы программы.

            Допустим у нас есть базовый класс Bird, по логике птица должна уметь летать, однако если мы создадим класс Chiсken, унаследовав его 
            от Bird мы нарушим данный принцип, потому что курица не может летать и это нарушает контракт базового класса,
            соответственно если где-то в коде мы подставим Chiсken вместо Bird мы сломаем программу. 
            Поэтому нужно внимательно соблюдать данный принцип, ведь его легко нарушить. Такие баги вызывают
            поломки не на этапе компиляции, а в рантайме.

                I - interface segregation - Принцип разделения интерфейсов.
            Классу могут быть не нужны все методы реализуемого интерфейса, и в данном случае лучше разделить сам интерфейс на несколько более простых.

            Допустим у нас есть интерфейс IDeveloper, который содержит в себе методы CreateBackendApp(); CreateFrontendApp(); CreateMobileApp();

            Но сами разработчики могут быть отдельно frontend, backend или же mobile разработчиками, и каждому из них нужен 
            только 1 свой метод, но он вынужден реализовывать все остальные. Поэтому лучше разделить 1 интерфейс IDeveloper на 3 более простых, 
            IBackendDeveloper, IFrontendDeveloper и IMobileDeveloper и в каждый поместить свой метод. Тогда каждый класс Developer сможет
            реализовывать только те методы, которые он, можно сказать, "умеет'

                D - dependency inversion - принцип инверсии зависимостей.
            Модули верхнего уровня не должны зависеть от модулей нижнего уровня. Оба должны зависеть от абстракций.

            Т.е допустим у нас есть класс по обработке документов DocumentService. ему для работы необходим SqliteDocumentsRepository - данный подход плох тем,
            что если мы захотим поменять провайдера бд на допустим тот же Postgresql,то логика работы высокоуровневого модуля DocumentService сломается.

            Поэтому лучше добавить абстракцию, в данном случае интерфейс IRepository и передавать его в конструктор DocumentService, а сам SqliteDocumentsRepository
            должен будет реализовывать IRepository. В таком случае, если мы захотим поменять провайдера баз данных на PostgreSQL, то мы напишем 
            PostgreSQLDocumentRepository : IRepository, который и будет подставляться в конструктор DocumentService, таким образом мы не будем каждый раз 
            ломать логику работы приложения, при изменении провайдера данных.
             */
        }
    }
}
