namespace TestTasks1_51
{
    internal class Task6_2
    {
        public void Do()
        {
            /*
             
            6.2	Инженерная задача
                Есть 2 столба, между ними висит провод длиной 184,2 метра
                От нижней точки висящего провода до земли 7,9 метра
                Высота столбов 100 метров

                Вопрос: Каково расстояние между столбами?

                Ответ: 0. Если от высоты столба отнять расстояние до земли от нижней точки висящего провода то получим 92.1 метра.
            Если поделить длину провода пополам то тоже получим 92.1 метра, 
            соответственно провод свисает вертикально вниз. 
            А это значит что расстояние между столбами 0 метров.

             */
        }
    }
}
