
namespace TestTasks1_51
{
    internal class Task3_3
    {
        public void Do()
        {
            /*
             3.3	ЗАДАЧА НА ДИАГНОСТИКУ ПРОБЛЕМЫ. 
                Есть автоматическое задание (task), которое выполняется каждую минуту. Таск регистрирует электронный документ «Результаты торгов». При регистрации документа возможно изменить атрибуты записи в БД. Таск также определяется SQL запросом, который, собственно, и выбирает лоты, по которым надо сформировать этот документ. Вот пример этого SQL:
                SELECT Bid.Id, Purchase.OrgBuId, Purchase.TypeId
                FROM Bid JOIN Purchase ON Purchase.Id = Bid.PurchaseId
                WHERE Bid.StatusId = 6
                Ситуация: вечером был перенос этого таска с тестового на боевой сервер. На следующий день вы приходите с утра и видите, что по всем подходящим лотам всю ночь каждую минуту формировался этот документ. 
                Вопрос: почему так произошло и что надо исправить?

            Ответ:
            Вся проблема в том что Bid.StatusId не меняется после того как 
            электронный документ зарегестрирован.
            И получается что для записей у которых уже есть документ 
            задача генерирует каждый раз еще 1.
            Чтобы исправить нужно при генерации документа менять Bid.StatusId
            допустим на 7, тогда при запуска задачи документ будет 
            регистрироваться только для новых лотов, у которых Bid.StatusId будет 6
             */
        }
    }
}
